Repository: apertium/apertium-sme-smj
Catalog: tmx_data/jorgaleddjiide_sme2smj.tmx
Source language: sme
Languages: smj

source: Buore beaivvi!
smj: Buoris!

source: Romssa universitehta Giellatekno-joavku lea ráhkadeamen dihtorjorgalanprográmma davvisámegielas julevsámegillii maid jorgaleaddji sáhttá geavahit veahkkin dalle go jorgala teavsttaid.
smj: Råmså universitiehta Giellatekno-juogos le åvddånahttemin dáhtájårggålimprográmmav nuorttasámegielas julevsámegiellaj majt jårggåliddjijda máhttá viehkken adnet gå tevstajt jårggål.

source: Dihtorjorgalanprográmma ii goassege boađe jorgaleaddji sadjái, muhto jurdda lea ahte jorgaleaddji dáinna veahkkeneavvuin seasttášii áiggi.
smj: Dáhtájårggålimprográmma ij dal goassak sjatta boahtet jårggåliddje sadjáj, valla ájádus le jårggåliddje dájna viehkkenævojn sæsstá ájgev.

source: Min bargu lea álgomuttus, muhto háliidit árvvoštallat prográmma dási, ja dasa dárbbašit jorgaleddjiid veahkkin dáinna lágiin:
smj: Mijá barggo l álggomutton, valla sihtap huoman prográmma dásev árvustallat, ja dási dárbahip jårggåliddjijt viehkken tjuovvovasj láhkáj:

source: Mii sáddet dutnje guokte dárogiel teavstta, A ja B, goappašagain leat sullii 300 sáni.
smj: Sáddip dunji guokta dárogieltevsta, A ja B, goappátjijn li sulle 300 bágo.

source: B-tekstii oaččut maiddái jorgalusa mii lea jorgaluvvon min dihtorprográmmain.
smj: B-tækstaj oattjo duodden jårggålimev mij la mijá dáhtáprográmma baktu jårggåluvvam.

source: Vuosttažettiin háliidit diehtit leago du mielas ávkkálaš geavahit dihtorjorgalusa veahkkin go jorgalat, ja mo don geavahat teavstta.
smj: Sihtap vuostatjabmusin diehtet jus dáhtájårggålibme l duv mielas ávkálasj viehkken adnet gå jårggåla, ja gåktu aná tevstav.

source: Leigo dan mađe buorre ahte sáhtát dušše divvut teavstta, vai čálletgo áibbas ođđa teavstta?
smj: Lej gus duola dagu nav buorre jut dárbahi dåssju divvot tevstav, jali tjálli gus ållu ådå tevstav?

source: Mii háliidit maiddái diehtit man guhkes áiggi don geavahat jorgalit dan guokte teavstta (manaigo johtileappot jorgalit B-teavstta go A? Man ollu johtileappot?).
smj: Sihtap aj diehtet man guhkev adni jårggålittjat dáv guovtev tevstav (manáj gus jåhtelappot jårggålit B-tevstav gå A? Man ållo jåhtelappot?).

source: Mii sáddet teavsttaid 3-4 jorgaleaddjái, ja áigut maŋŋel čujuhit dasa maid jorgaleaddjit oaivvildit ja mo sii jorgalit eará ládje go mo dihtorprográmma jorgala, muhto eat áiggo makkárge oktavuođas muitalit jorgaleddjiid namaid.
smj: Mij sáddip tevstajt 3-4 jårggåliddjáj, ja ájggop maŋŋela guoradallat majt jårggåliddje árvvalin ja gåktu sij jårggåli iehtjá láhkáj dáhtáprográmmas, valla ep galga makkirak aktijvuodan substastit jårggåliddjij namájt.

source: Ieš jorgalusat leat maiddái midjiide ávkin go bargat viidáseappot prográmmain.
smj: Jur jårggålime li aj midjij ávkken gå vijddásappot prográmmajn barggap.

source: Jus don leat mielde dán barggus, de oaččut teavsttaid e-boastta bokte čakčamánu gaskkamuttus, ja oaččut vahku dán bargui.
smj: Jus sebra dán bargguj, de oattjo tevstajt e-mejla baktu ragátmáno gasskamuttoj ja oattjo váhkov dán bargguj.

source: Barggu ovddas oaččut 2000 ru.
smj: Bargo åvdås oattjo 2000 kr.
